slides.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Namespace, Vars, and Symbols (Oh, My!)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-02-17 11:17:54 EST"/>
<meta name="author" content="Craig Andera"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="common.css" />
<link rel="stylesheet" type="text/css" href="screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="presenter.css" media="presenter" />
<link rel="stylesheet" type="text/css" href="local.css" />
</head>
<body>
<div id="content">

<h1 class="title">Namespace, Vars, and Symbols (Oh, My!)</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Namespaces, Vars, and Symbols (Oh, My!)</a>
<ul>
<li><a href="#sec-1.1">1.1 Intended Audience</a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 People who have been using Clojure a bit </a></li>
<li><a href="#sec-1.1.2">1.1.2 People who haven't written a book about it </a></li>
<li><a href="#sec-1.1.3">1.1.3 Anyone who remains confused about <code>(ns)</code> syntax </a></li>
</ul>
</li>
<li><a href="#sec-1.2">1.2 The Big Pile of Code </a></li>
<li><a href="#sec-1.3">1.3 What's Going On Here?</a>
<ul>
<li><a href="#sec-1.3.1">1.3.1 Ultimately, a load of 'hello.clj' </a></li>
<li><a href="#sec-1.3.2">1.3.2 But what really happens? </a></li>
<li><a href="#sec-1.3.3">1.3.3 The <b>RE</b> of <b>REPL</b> </a></li>
</ul>
</li>
<li><a href="#sec-1.4">1.4 What is a Symbol?</a>
<ul>
<li><a href="#sec-1.4.1">1.4.1 A name </a></li>
<li><a href="#sec-1.4.2">1.4.2 With an optional namespace </a></li>
<li><a href="#sec-1.4.3">1.4.3 Has no value </a></li>
</ul>
</li>
<li><a href="#sec-1.5">1.5 What is a Namespace?</a>
<ul>
<li><a href="#sec-1.5.1">1.5.1 A mapping from symbols to </a></li>
</ul>
</li>
<li><a href="#sec-1.6">1.6 Viewing the Mappings</a>
<ul>
<li><a href="#sec-1.6.1">1.6.1 <code>ns-mappings</code>: </a></li>
</ul>
</li>
<li><a href="#sec-1.7">1.7 What is a Var?</a>
<ul>
<li><a href="#sec-1.7.1">1.7.1 A name and zero more values </a></li>
<li><a href="#sec-1.7.2">1.7.2 A var with zero values is <i>unbound</i> </a></li>
<li><a href="#sec-1.7.3">1.7.3 Usually has one value: the <i>root</i> value </a></li>
<li><a href="#sec-1.7.4">1.7.4 Can have a per-thread value, too </a></li>
</ul>
</li>
<li><a href="#sec-1.8">1.8 Creating Vars</a>
<ul>
<li><a href="#sec-1.8.1">1.8.1 <code>def</code> creates a new var in the current namespace </a></li>
<li><a href="#sec-1.8.2">1.8.2 Optionally associates a value </a></li>
</ul>
</li>
<li><a href="#sec-1.9">1.9 Referring Vars</a>
<ul>
<li><a href="#sec-1.9.1">1.9.1 Vars from other namespaces can be mapped in </a></li>
<li><a href="#sec-1.9.2">1.9.2 <code>refer</code> does this </a></li>
<li><a href="#sec-1.9.3">1.9.3 Can pull them in selectively via <code>:only</code> or <code>:exclude</code> </a></li>
</ul>
</li>
<li><a href="#sec-1.10">1.10 How are Symbols Evaluated?</a>
<ul>
<li><a href="#sec-1.10.1">1.10.1 Does it have a namespace? </a></li>
<li><a href="#sec-1.10.2">1.10.2 Does it look like <code>some.package.class</code>? </a></li>
<li><a href="#sec-1.10.3">1.10.3 Symbol with no namespace </a></li>
</ul>
</li>
<li><a href="#sec-1.11">1.11 Require?</a></li>
<li><a href="#sec-1.12">1.12 Refer?</a></li>
<li><a href="#sec-1.13">1.13 <code>ns</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Namespaces, Vars, and Symbols (Oh, My!) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="title">title</span>&nbsp;<span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">





</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Intended Audience &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> People who have been using Clojure a bit </h4>
<div class="outline-text-4" id="text-1.1.1">

</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> People who haven't written a book about it </h4>
<div class="outline-text-4" id="text-1.1.2">

</div>

</div>

<div id="outline-container-1.1.3" class="outline-4">
<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> Anyone who remains confused about <code>(ns)</code> syntax </h4>
<div class="outline-text-4" id="text-1.1.3">


</div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> The Big Pile of Code </h3>
<div class="outline-text-3" id="text-1.2">






<pre class="src src-clojure">(<span style="color: #b0c4de;">ns</span> hello
  (<span style="color: #7fffd4;">:require</span> [clojure.string <span style="color: #7fffd4;">:as</span> str]))

(<span style="color: #00ffff;">defn</span> <span style="color: #87cefa;">-main</span> [&amp; args]
  (<span style="color: #eedd82;">println</span> <span style="color: #ffa07a;">"hello"</span> (str/<span style="color: #98fb98;">join</span> <span style="color: #ffa07a;">" and "</span> args)))
</pre>




</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> What's Going On Here? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.3">


</div>

<div id="outline-container-1.3.1" class="outline-4">
<h4 id="sec-1.3.1"><span class="section-number-4">1.3.1</span> Ultimately, a load of 'hello.clj' </h4>
<div class="outline-text-4" id="text-1.3.1">

</div>

</div>

<div id="outline-container-1.3.2" class="outline-4">
<h4 id="sec-1.3.2"><span class="section-number-4">1.3.2</span> But what really happens? </h4>
<div class="outline-text-4" id="text-1.3.2">

</div>

</div>

<div id="outline-container-1.3.3" class="outline-4">
<h4 id="sec-1.3.3"><span class="section-number-4">1.3.3</span> The <b>RE</b> of <b>REPL</b> </h4>
<div class="outline-text-4" id="text-1.3.3">



</div>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> What is a Symbol? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.4">


</div>

<div id="outline-container-1.4.1" class="outline-4">
<h4 id="sec-1.4.1"><span class="section-number-4">1.4.1</span> A name </h4>
<div class="outline-text-4" id="text-1.4.1">

</div>

</div>

<div id="outline-container-1.4.2" class="outline-4">
<h4 id="sec-1.4.2"><span class="section-number-4">1.4.2</span> With an optional namespace </h4>
<div class="outline-text-4" id="text-1.4.2">

</div>

</div>

<div id="outline-container-1.4.3" class="outline-4">
<h4 id="sec-1.4.3"><span class="section-number-4">1.4.3</span> Has no value </h4>
<div class="outline-text-4" id="text-1.4.3">


</div>
</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> What is a Namespace? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.5">


</div>

<div id="outline-container-1.5.1" class="outline-4">
<h4 id="sec-1.5.1"><span class="section-number-4">1.5.1</span> A mapping from symbols to </h4>
<div class="outline-text-4" id="text-1.5.1">

<ul>
<li id="sec-1.5.1.1">Java classes <br/>
</li>
<li id="sec-1.5.1.2">Vars <br/>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Viewing the Mappings &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.6">


</div>

<div id="outline-container-1.6.1" class="outline-4">
<h4 id="sec-1.6.1"><span class="section-number-4">1.6.1</span> <code>ns-mappings</code>: </h4>
<div class="outline-text-4" id="text-1.6.1">


</div>
</div>

</div>

<div id="outline-container-1.7" class="outline-3">
<h3 id="sec-1.7"><span class="section-number-3">1.7</span> What is a Var? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.7">


</div>

<div id="outline-container-1.7.1" class="outline-4">
<h4 id="sec-1.7.1"><span class="section-number-4">1.7.1</span> A name and zero more values </h4>
<div class="outline-text-4" id="text-1.7.1">

</div>

</div>

<div id="outline-container-1.7.2" class="outline-4">
<h4 id="sec-1.7.2"><span class="section-number-4">1.7.2</span> A var with zero values is <i>unbound</i> </h4>
<div class="outline-text-4" id="text-1.7.2">

</div>

</div>

<div id="outline-container-1.7.3" class="outline-4">
<h4 id="sec-1.7.3"><span class="section-number-4">1.7.3</span> Usually has one value: the <i>root</i> value </h4>
<div class="outline-text-4" id="text-1.7.3">

</div>

</div>

<div id="outline-container-1.7.4" class="outline-4">
<h4 id="sec-1.7.4"><span class="section-number-4">1.7.4</span> Can have a per-thread value, too </h4>
<div class="outline-text-4" id="text-1.7.4">

<ul>
<li id="sec-1.7.4.1">Via <code>binding</code>, iff marked <code>^:dynamic</code> <br/>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1.8" class="outline-3">
<h3 id="sec-1.8"><span class="section-number-3">1.8</span> Creating Vars &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.8">


</div>

<div id="outline-container-1.8.1" class="outline-4">
<h4 id="sec-1.8.1"><span class="section-number-4">1.8.1</span> <code>def</code> creates a new var in the current namespace </h4>
<div class="outline-text-4" id="text-1.8.1">

</div>

</div>

<div id="outline-container-1.8.2" class="outline-4">
<h4 id="sec-1.8.2"><span class="section-number-4">1.8.2</span> Optionally associates a value </h4>
<div class="outline-text-4" id="text-1.8.2">





<pre class="src src-clojure">(<span style="color: #b0c4de;">ns</span> some.name)

<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Var #'some.name/foo is unbound
</span>(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">foo</span>)

<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Var #'some.name/bar has value 17
</span>(<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">bar</span> 17)
</pre>




</div>
</div>

</div>

<div id="outline-container-1.9" class="outline-3">
<h3 id="sec-1.9"><span class="section-number-3">1.9</span> Referring Vars &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.9">


</div>

<div id="outline-container-1.9.1" class="outline-4">
<h4 id="sec-1.9.1"><span class="section-number-4">1.9.1</span> Vars from other namespaces can be mapped in </h4>
<div class="outline-text-4" id="text-1.9.1">

</div>

</div>

<div id="outline-container-1.9.2" class="outline-4">
<h4 id="sec-1.9.2"><span class="section-number-4">1.9.2</span> <code>refer</code> does this </h4>
<div class="outline-text-4" id="text-1.9.2">

</div>

</div>

<div id="outline-container-1.9.3" class="outline-4">
<h4 id="sec-1.9.3"><span class="section-number-4">1.9.3</span> Can pull them in selectively via <code>:only</code> or <code>:exclude</code> </h4>
<div class="outline-text-4" id="text-1.9.3">





<pre class="src src-clojure"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Refer all public symbols in net.cgrand.enlive-html
</span>(<span style="color: #b0c4de;">refer</span> 'net.cgrand.enlive-html)

<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Refer only foo and bar
</span>(<span style="color: #b0c4de;">refer</span> '[blah.whatever <span style="color: #7fffd4;">:only</span> (foo bar)])

<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Refer everything except defroutes and GET
</span>(<span style="color: #b0c4de;">refer</span> '[compojure.core <span style="color: #7fffd4;">:except</span> (defroutes GET)])
</pre>




</div>
</div>

</div>

<div id="outline-container-1.10" class="outline-3">
<h3 id="sec-1.10"><span class="section-number-3">1.10</span> How are Symbols Evaluated? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.10">



</div>

<div id="outline-container-1.10.1" class="outline-4">
<h4 id="sec-1.10.1"><span class="section-number-4">1.10.1</span> Does it have a namespace? </h4>
<div class="outline-text-4" id="text-1.10.1">

<ul>
<li id="sec-1.10.1.1">Resolve to the var in that namespace <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.10.2" class="outline-4">
<h4 id="sec-1.10.2"><span class="section-number-4">1.10.2</span> Does it look like <code>some.package.class</code>? </h4>
<div class="outline-text-4" id="text-1.10.2">

<ul>
<li id="sec-1.10.2.1">Resolve to that Java class <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.10.3" class="outline-4">
<h4 id="sec-1.10.3"><span class="section-number-4">1.10.3</span> Symbol with no namespace </h4>
<div class="outline-text-4" id="text-1.10.3">

<ul>
<li id="sec-1.10.3.1">Is it special form? <br/>
<ul>
<li id="sec-1.10.3.1.1">Handled specially by the compiler <br/>
</li>
</ul>
</li>
<li id="sec-1.10.3.2">Is it an imported Java class? <br/>
<ul>
<li id="sec-1.10.3.2.1">Resolve to that class <br/>
</li>
</ul>
</li>
<li id="sec-1.10.3.3">Is it a local binding? <br/>
<ul>
<li id="sec-1.10.3.3.1">Resolve to that local <br/>
</li>
</ul>
</li>
<li id="sec-1.10.3.4">Is it interned in the current namespace? <br/>
<ul>
<li id="sec-1.10.3.4.1">Resolve to that var <br/>


</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1.11" class="outline-3">
<h3 id="sec-1.11"><span class="section-number-3">1.11</span> Require? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.11">


<p>
Should I talk about <code>require</code>?
</p>
</div>

</div>

<div id="outline-container-1.12" class="outline-3">
<h3 id="sec-1.12"><span class="section-number-3">1.12</span> Refer? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.12">


<p>
Should I talk about <code>refer</code>?
</p>
</div>

</div>

<div id="outline-container-1.13" class="outline-3">
<h3 id="sec-1.13"><span class="section-number-3">1.13</span> <code>ns</code> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1.13">


<p>
Should I talk about the <code>ns</code> macro?
</p>




<script type="text/javascript" src="org-html-slides.js"></script>




</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Craig Andera
<a href="mailto:craig@thinkrelevance.com">&lt;craig@thinkrelevance.com&gt;</a>
</p>
<p class="date"> Date: 2012-02-17 11:17:54 EST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
